---
kind: method
id: M:Autodesk.Revit.DB.WallSweep.GetWallSweepInfo
source: html/112964bb-a1ae-1c0e-44af-d721e763c8e0.htm
---
# Autodesk.Revit.DB.WallSweep.GetWallSweepInfo Method

Gets the information of the wall sweep or reveal.

## Syntax (C#)
```csharp
public WallSweepInfo GetWallSweepInfo()
```

## Returns
The information that describes the wall sweep or reveal.